test_cases/singleCore/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          34;
        startFace       29545;
    }
    outlet
    {
        type            patch;
        nFaces          34;
        startFace       29579;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          850;
        startFace       29613;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          96;
        startFace       30463;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          30052;
        startFace       30559;
    }
)

// ************************************************************************* //
