test_cases/singleCore/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                |                                                  |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \    /   O peration     | Version:  5                                      |
|   \  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \/     M anipulation  |                                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.4 0 -0.05)
    (0.8 0 -0.05)
    (10.6 0 -0.05)
    (10.6 0.5656880000000001 -0.05)
    (0.5656880000000001 0.5656880000000001 -0.05)
    (0.28284400000000004 0.28284400000000004 -0.05)
    (10.6 1.0 -0.05)
    (0.5656880000000001 1.0 -0.05)
    (0 1.0 -0.05)
    (0 0.8 -0.05)
    (0 0.4 -0.05)
    (-0.4 0 -0.05)
    (-0.8 0 -0.05)
    (-4.4 0 -0.05)
    (-4.4 0.5656880000000001 -0.05)
    (-0.5656880000000001 0.5656880000000001 -0.05)
    (-0.28284400000000004 0.28284400000000004 -0.05)
    (-4.4 1.0 -0.05)
    (-0.5656880000000001 1.0 -0.05)
    (0.4 0 0.05)
    (0.8 0 0.05)
    (10.6 0 0.05)
    (10.6 0.5656880000000001 0.05)
    (0.5656880000000001 0.5656880000000001 0.05)
    (0.28284400000000004 0.28284400000000004 0.05)
    (10.6 1.0 0.05)
    (0.5656880000000001 1.0 0.05)
    (0 1.0 0.05)
    (0 0.8 0.05)
    (0 0.4 0.05)
    (-0.4 0 0.05)
    (-0.8 0 0.05)
    (-4.4 0 0.05)
    (-4.4 0.5656880000000001 0.05)
    (-0.5656880000000001 0.5656880000000001 0.05)
    (-0.28284400000000004 0.28284400000000004 0.05)
    (-4.4 1.0 0.05)
    (-0.5656880000000001 1.0 0.05)
);

blocks
(
    hex (5 4 9 10 24 23 28 29) (12 12 1) simpleGrading (1 1 1)
    hex (0 1 4 5 19 20 23 24) (12 12 1) simpleGrading (1 1 1)
    hex (1 2 3 4 20 21 22 23) (293 12 1) simpleGrading (10 1 1)
    hex (4 3 6 7 23 22 25 26) (293 5 1) simpleGrading (10 1.0 1)
    hex (9 4 7 8 28 23 26 27) (12 5 1) simpleGrading (1 1.0 1)
    hex (15 16 10 9 34 35 29 28) (12 12 1) simpleGrading (1.0 1 1)
    hex (12 11 16 15 31 30 35 34) (12 12 1) simpleGrading (1.0 1 1)
    hex (13 12 15 14 32 31 34 33) (108 12 1) simpleGrading (0.1 1 1)
    hex (14 15 18 17 33 34 37 36) (108 5 1) simpleGrading (0.1 1.0 1)
    hex  (15 9 8 18 34 28 27 37) (12 5 1) simpleGrading (1 1.0 1)
);

edges
(
    arc 0 5 (0.34640000000000004 0.2 -0.05)
    arc 5 10 (0.2 0.34640000000000004 -0.05)
    arc 1 4 (0.4 0.6928000000000001 -0.05)
    arc 4 9 (0.4 0.6928000000000001 -0.05)
    arc 19 24 (0.34640000000000004 0.2 0.05)
    arc 24 29 (0.2 0.34640000000000004 0.05)
    arc 20 23 (0.4 0.6928000000000001 0.05)
    arc 23 28 (0.4 0.6928000000000001 0.05)
    arc 11 16 (-0.34640000000000004 0.2 -0.05)
    arc 16 10 (-0.2 0.34640000000000004 -0.05)
    arc 12 15 (-0.4 0.6928000000000001 -0.05)
    arc 15 9 (-0.4 0.6928000000000001 -0.05)
    arc 30 35 (-0.34640000000000004 0.2 0.05)
    arc 35 29 (-0.2 0.34640000000000004 0.05)
    arc 31 34 (-0.4 0.6928000000000001 0.05)
    arc 34 28 (-0.4 0.6928000000000001 0.05)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (14 13 32 33)
            (17 14 33 36)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 3 22 21)
		 (3 6 25 22)
        );
    }
    top
    {
        type wall;
        faces
        (
            (7 8 27 26)
            (6 7 26 25)
            (8 18 37 27)
            (18 17 36 37)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (10 5 24 29)
            (5 0 19 24)
            (16 10 29 35)
            (11 16 35 30)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
